# Brewfile — essentials only
# Install with: brew bundle

# Shell
brew "fish"
brew "starship"         # prompt fallback (if not using tide)

# Git
brew "git"
brew "gh"               # GitHub CLI
brew "git-delta"        # better diffs
brew "lazygit"          # TUI git client

# Terminal tools
brew "eza"              # better ls
brew "bat"              # better cat
brew "fd"               # better find
brew "fzf"              # fuzzy finder (used by fzf.fish)
brew "jq"               # JSON — required by claude statusline
brew "yq"               # YAML

# Dev
brew "uv"               # Python runner (required by CLAUDE.md)
brew "ruff"             # Python linter
brew "biome"            # JS/TS formatter
brew "node"             # Node.js

# System
brew "btop"             # resource monitor
brew "curl"
