jorgebucaran/fisher
ilancosman/tide
patrickf1/fzf.fish
franciscolourenco/done
laughedelic/pisces
catppuccin/fish
meaningful-ooo/sponge
jethrokuan/z
